{
    "_name_or_path": "facebook/opt-350m",
    "_remove_final_layer_norm": false,
    "activation_dropout": 0.0,
    "activation_function": "relu",
    "architectures": [
        "OPTForSequenceClassification"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 2,
    "dataset_name": "ai4privacy/pii-masking-65k",
    "do_layer_norm_before": false,
    "dropout": 0.1,
    "enable_bias": true,
    "eos_token_id": 2,
    "ffn_dim": 4096,
    "hidden_size": 1024,
    "id2label": {
        "0": "I-CREDITCARDNUMBER",
        "1": "B-SUFFIX",
        "10": "I-MIDDLENAME",
        "100": "I-AMOUNT",
        "101": "I-COMPANY_NAME",
        "102": "B-BIC",
        "103": "I-CURRENCYCODE",
        "11": "B-COMPANY_NAME",
        "12": "B-SEX",
        "13": "B-BUILDINGNUMBER",
        "14": "I-URL",
        "15": "B-DATE",
        "16": "I-TIME",
        "17": "B-VEHICLEVRM",
        "18": "I-IPV6",
        "19": "I-FULLNAME",
        "2": "B-MASKEDNUMBER",
        "20": "I-VEHICLEVRM",
        "21": "B-FIRSTNAME",
        "22": "B-PHONEIMEI",
        "23": "B-URL",
        "24": "I-MASKEDNUMBER",
        "25": "B-STREETADDRESS",
        "26": "B-PHONE_NUMBER",
        "27": "I-ACCOUNTNUMBER",
        "28": "B-PREFIX",
        "29": "B-TIME",
        "3": "I-USERAGENT",
        "30": "I-DATE",
        "31": "I-CREDITCARDISSUER",
        "32": "B-JOBAREA",
        "33": "I-CURRENCYSYMBOL",
        "34": "I-JOBAREA",
        "35": "B-BITCOINADDRESS",
        "36": "I-MAC",
        "37": "B-CURRENCYCODE",
        "38": "B-VEHICLEVIN",
        "39": "B-IPV4",
        "4": "B-PIN",
        "40": "B-EMAIL",
        "41": "B-CREDITCARDNUMBER",
        "42": "I-PHONE_NUMBER",
        "43": "I-SUFFIX",
        "44": "B-SECONDARYADDRESS",
        "45": "I-SSN",
        "46": "I-BUILDINGNUMBER",
        "47": "I-IPV4",
        "48": "B-CREDITCARDISSUER",
        "49": "B-ETHEREUMADDRESS",
        "5": "B-MIDDLENAME",
        "50": "I-IBAN",
        "51": "I-PIN",
        "52": "I-JOBTYPE",
        "53": "I-JOBTITLE",
        "54": "I-STREET",
        "55": "I-PHONEIMEI",
        "56": "B-COUNTY",
        "57": "I-IP",
        "58": "I-STATE",
        "59": "B-ZIPCODE",
        "6": "B-MAC",
        "60": "I-ACCOUNTNAME",
        "61": "I-CREDITCARDCVV",
        "62": "B-CITY",
        "63": "B-USERAGENT",
        "64": "I-CURRENCY",
        "65": "I-STREETADDRESS",
        "66": "I-VEHICLEVIN",
        "67": "I-USERNAME",
        "68": "B-FULLNAME",
        "69": "I-PREFIX",
        "7": "B-LASTNAME",
        "70": "I-LASTNAME",
        "71": "B-PASSWORD",
        "72": "I-ZIPCODE",
        "73": "B-JOBTYPE",
        "74": "B-IP",
        "75": "B-USERNAME",
        "76": "B-IPV6",
        "77": "B-JOBDESCRIPTOR",
        "78": "B-AMOUNT",
        "79": "I-EMAIL",
        "8": "I-CURRENCYNAME",
        "80": "B-CREDITCARDCVV",
        "81": "O",
        "82": "B-CURRENCY",
        "83": "B-CURRENCYNAME",
        "84": "I-LITECOINADDRESS",
        "85": "B-STATE",
        "86": "I-ETHEREUMADDRESS",
        "87": "B-ACCOUNTNUMBER",
        "88": "B-CURRENCYSYMBOL",
        "89": "B-SSN",
        "9": "B-STREET",
        "90": "I-CITY",
        "91": "I-SECONDARYADDRESS",
        "92": "I-BIC",
        "93": "I-BITCOINADDRESS",
        "94": "I-PASSWORD",
        "95": "I-FIRSTNAME",
        "96": "B-LITECOINADDRESS",
        "97": "B-ACCOUNTNAME",
        "98": "B-IBAN",
        "99": "B-JOBTITLE"
    },
    "init_std": 0.02,
    "label2id": {
        "B-ACCOUNTNAME": 97,
        "B-ACCOUNTNUMBER": 87,
        "B-AMOUNT": 78,
        "B-BIC": 102,
        "B-BITCOINADDRESS": 35,
        "B-BUILDINGNUMBER": 13,
        "B-CITY": 62,
        "B-COMPANY_NAME": 11,
        "B-COUNTY": 56,
        "B-CREDITCARDCVV": 80,
        "B-CREDITCARDISSUER": 48,
        "B-CREDITCARDNUMBER": 41,
        "B-CURRENCY": 82,
        "B-CURRENCYCODE": 37,
        "B-CURRENCYNAME": 83,
        "B-CURRENCYSYMBOL": 88,
        "B-DATE": 15,
        "B-EMAIL": 40,
        "B-ETHEREUMADDRESS": 49,
        "B-FIRSTNAME": 21,
        "B-FULLNAME": 68,
        "B-IBAN": 98,
        "B-IP": 74,
        "B-IPV4": 39,
        "B-IPV6": 76,
        "B-JOBAREA": 32,
        "B-JOBDESCRIPTOR": 77,
        "B-JOBTITLE": 99,
        "B-JOBTYPE": 73,
        "B-LASTNAME": 7,
        "B-LITECOINADDRESS": 96,
        "B-MAC": 6,
        "B-MASKEDNUMBER": 2,
        "B-MIDDLENAME": 5,
        "B-PASSWORD": 71,
        "B-PHONEIMEI": 22,
        "B-PHONE_NUMBER": 26,
        "B-PIN": 4,
        "B-PREFIX": 28,
        "B-SECONDARYADDRESS": 44,
        "B-SEX": 12,
        "B-SSN": 89,
        "B-STATE": 85,
        "B-STREET": 9,
        "B-STREETADDRESS": 25,
        "B-SUFFIX": 1,
        "B-TIME": 29,
        "B-URL": 23,
        "B-USERAGENT": 63,
        "B-USERNAME": 75,
        "B-VEHICLEVIN": 38,
        "B-VEHICLEVRM": 17,
        "B-ZIPCODE": 59,
        "I-ACCOUNTNAME": 60,
        "I-ACCOUNTNUMBER": 27,
        "I-AMOUNT": 100,
        "I-BIC": 92,
        "I-BITCOINADDRESS": 93,
        "I-BUILDINGNUMBER": 46,
        "I-CITY": 90,
        "I-COMPANY_NAME": 101,
        "I-CREDITCARDCVV": 61,
        "I-CREDITCARDISSUER": 31,
        "I-CREDITCARDNUMBER": 0,
        "I-CURRENCY": 64,
        "I-CURRENCYCODE": 103,
        "I-CURRENCYNAME": 8,
        "I-CURRENCYSYMBOL": 33,
        "I-DATE": 30,
        "I-EMAIL": 79,
        "I-ETHEREUMADDRESS": 86,
        "I-FIRSTNAME": 95,
        "I-FULLNAME": 19,
        "I-IBAN": 50,
        "I-IP": 57,
        "I-IPV4": 47,
        "I-IPV6": 18,
        "I-JOBAREA": 34,
        "I-JOBTITLE": 53,
        "I-JOBTYPE": 52,
        "I-LASTNAME": 70,
        "I-LITECOINADDRESS": 84,
        "I-MAC": 36,
        "I-MASKEDNUMBER": 24,
        "I-MIDDLENAME": 10,
        "I-PASSWORD": 94,
        "I-PHONEIMEI": 55,
        "I-PHONE_NUMBER": 42,
        "I-PIN": 51,
        "I-PREFIX": 69,
        "I-SECONDARYADDRESS": 91,
        "I-SSN": 45,
        "I-STATE": 58,
        "I-STREET": 54,
        "I-STREETADDRESS": 65,
        "I-SUFFIX": 43,
        "I-TIME": 16,
        "I-URL": 14,
        "I-USERAGENT": 3,
        "I-USERNAME": 67,
        "I-VEHICLEVIN": 66,
        "I-VEHICLEVRM": 20,
        "I-ZIPCODE": 72,
        "O": 81
    },
    "layer_norm_elementwise_affine": true,
    "layerdrop": 0.0,
    "max_len": 32,
    "max_position_embeddings": 2048,
    "model_name": "facebook/opt-350m",
    "model_type": "opt",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "pad_token_id": 1,
    "prefix": "</s>",
    "problem_type": "single_label_classification",
    "torch_dtype": "float32",
    "transformers_version": "4.41.2",
    "use_cache": true,
    "vocab_size": 50272,
    "word_embed_proj_dim": 512
}