{
    "_name_or_path": "facebook/opt-350m",
    "_remove_final_layer_norm": false,
    "activation_dropout": 0.0,
    "activation_function": "relu",
    "architectures": [
        "OPTForSequenceClassification"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 2,
    "dataset_name": "ai4privacy/pii-masking-65k",
    "do_layer_norm_before": false,
    "dropout": 0.1,
    "enable_bias": true,
    "eos_token_id": 2,
    "ffn_dim": 4096,
    "hidden_size": 1024,
    "id2label": {
        "0": "B-IP",
        "1": "B-CURRENCY",
        "10": "I-PIN",
        "100": "B-IPV6",
        "101": "B-JOBDESCRIPTOR",
        "102": "B-SEX",
        "103": "B-USERNAME",
        "11": "B-IPV4",
        "12": "B-ACCOUNTNUMBER",
        "13": "B-FULLNAME",
        "14": "I-CREDITCARDNUMBER",
        "15": "I-PASSWORD",
        "16": "B-STREET",
        "17": "I-STREET",
        "18": "I-STATE",
        "19": "B-ETHEREUMADDRESS",
        "2": "B-BUILDINGNUMBER",
        "20": "B-JOBAREA",
        "21": "I-LASTNAME",
        "22": "B-BITCOINADDRESS",
        "23": "I-BIC",
        "24": "I-ETHEREUMADDRESS",
        "25": "B-TIME",
        "26": "O",
        "27": "I-VEHICLEVIN",
        "28": "I-BUILDINGNUMBER",
        "29": "B-AMOUNT",
        "3": "I-PHONEIMEI",
        "30": "I-FIRSTNAME",
        "31": "B-STREETADDRESS",
        "32": "I-VEHICLEVRM",
        "33": "B-STATE",
        "34": "B-USERAGENT",
        "35": "I-CURRENCY",
        "36": "B-CURRENCYCODE",
        "37": "I-PHONE_NUMBER",
        "38": "I-JOBTYPE",
        "39": "I-MIDDLENAME",
        "4": "I-IP",
        "40": "B-CREDITCARDNUMBER",
        "41": "B-VEHICLEVIN",
        "42": "B-CREDITCARDISSUER",
        "43": "B-DATE",
        "44": "B-CITY",
        "45": "B-ACCOUNTNAME",
        "46": "I-IPV4",
        "47": "B-MIDDLENAME",
        "48": "I-JOBAREA",
        "49": "I-URL",
        "5": "I-IPV6",
        "50": "I-PREFIX",
        "51": "B-ZIPCODE",
        "52": "B-CURRENCYSYMBOL",
        "53": "B-COUNTY",
        "54": "B-FIRSTNAME",
        "55": "B-BIC",
        "56": "B-LASTNAME",
        "57": "I-ZIPCODE",
        "58": "I-SECONDARYADDRESS",
        "59": "I-MAC",
        "6": "I-CREDITCARDISSUER",
        "60": "B-CREDITCARDCVV",
        "61": "I-JOBTITLE",
        "62": "I-CURRENCYNAME",
        "63": "B-URL",
        "64": "B-IBAN",
        "65": "I-SUFFIX",
        "66": "B-SSN",
        "67": "I-CURRENCYCODE",
        "68": "B-MASKEDNUMBER",
        "69": "B-SECONDARYADDRESS",
        "7": "B-CURRENCYNAME",
        "70": "B-PHONE_NUMBER",
        "71": "B-LITECOINADDRESS",
        "72": "I-STREETADDRESS",
        "73": "B-VEHICLEVRM",
        "74": "I-TIME",
        "75": "I-DATE",
        "76": "B-MAC",
        "77": "B-SUFFIX",
        "78": "I-LITECOINADDRESS",
        "79": "I-CURRENCYSYMBOL",
        "8": "I-BITCOINADDRESS",
        "80": "I-EMAIL",
        "81": "B-JOBTYPE",
        "82": "I-SSN",
        "83": "I-CREDITCARDCVV",
        "84": "B-PASSWORD",
        "85": "B-COMPANY_NAME",
        "86": "B-PREFIX",
        "87": "B-JOBTITLE",
        "88": "I-ACCOUNTNUMBER",
        "89": "B-PIN",
        "9": "I-AMOUNT",
        "90": "I-IBAN",
        "91": "I-FULLNAME",
        "92": "B-EMAIL",
        "93": "I-COMPANY_NAME",
        "94": "I-MASKEDNUMBER",
        "95": "I-ACCOUNTNAME",
        "96": "I-CITY",
        "97": "I-USERAGENT",
        "98": "I-USERNAME",
        "99": "B-PHONEIMEI"
    },
    "init_std": 0.02,
    "label2id": {
        "B-ACCOUNTNAME": 45,
        "B-ACCOUNTNUMBER": 12,
        "B-AMOUNT": 29,
        "B-BIC": 55,
        "B-BITCOINADDRESS": 22,
        "B-BUILDINGNUMBER": 2,
        "B-CITY": 44,
        "B-COMPANY_NAME": 85,
        "B-COUNTY": 53,
        "B-CREDITCARDCVV": 60,
        "B-CREDITCARDISSUER": 42,
        "B-CREDITCARDNUMBER": 40,
        "B-CURRENCY": 1,
        "B-CURRENCYCODE": 36,
        "B-CURRENCYNAME": 7,
        "B-CURRENCYSYMBOL": 52,
        "B-DATE": 43,
        "B-EMAIL": 92,
        "B-ETHEREUMADDRESS": 19,
        "B-FIRSTNAME": 54,
        "B-FULLNAME": 13,
        "B-IBAN": 64,
        "B-IP": 0,
        "B-IPV4": 11,
        "B-IPV6": 100,
        "B-JOBAREA": 20,
        "B-JOBDESCRIPTOR": 101,
        "B-JOBTITLE": 87,
        "B-JOBTYPE": 81,
        "B-LASTNAME": 56,
        "B-LITECOINADDRESS": 71,
        "B-MAC": 76,
        "B-MASKEDNUMBER": 68,
        "B-MIDDLENAME": 47,
        "B-PASSWORD": 84,
        "B-PHONEIMEI": 99,
        "B-PHONE_NUMBER": 70,
        "B-PIN": 89,
        "B-PREFIX": 86,
        "B-SECONDARYADDRESS": 69,
        "B-SEX": 102,
        "B-SSN": 66,
        "B-STATE": 33,
        "B-STREET": 16,
        "B-STREETADDRESS": 31,
        "B-SUFFIX": 77,
        "B-TIME": 25,
        "B-URL": 63,
        "B-USERAGENT": 34,
        "B-USERNAME": 103,
        "B-VEHICLEVIN": 41,
        "B-VEHICLEVRM": 73,
        "B-ZIPCODE": 51,
        "I-ACCOUNTNAME": 95,
        "I-ACCOUNTNUMBER": 88,
        "I-AMOUNT": 9,
        "I-BIC": 23,
        "I-BITCOINADDRESS": 8,
        "I-BUILDINGNUMBER": 28,
        "I-CITY": 96,
        "I-COMPANY_NAME": 93,
        "I-CREDITCARDCVV": 83,
        "I-CREDITCARDISSUER": 6,
        "I-CREDITCARDNUMBER": 14,
        "I-CURRENCY": 35,
        "I-CURRENCYCODE": 67,
        "I-CURRENCYNAME": 62,
        "I-CURRENCYSYMBOL": 79,
        "I-DATE": 75,
        "I-EMAIL": 80,
        "I-ETHEREUMADDRESS": 24,
        "I-FIRSTNAME": 30,
        "I-FULLNAME": 91,
        "I-IBAN": 90,
        "I-IP": 4,
        "I-IPV4": 46,
        "I-IPV6": 5,
        "I-JOBAREA": 48,
        "I-JOBTITLE": 61,
        "I-JOBTYPE": 38,
        "I-LASTNAME": 21,
        "I-LITECOINADDRESS": 78,
        "I-MAC": 59,
        "I-MASKEDNUMBER": 94,
        "I-MIDDLENAME": 39,
        "I-PASSWORD": 15,
        "I-PHONEIMEI": 3,
        "I-PHONE_NUMBER": 37,
        "I-PIN": 10,
        "I-PREFIX": 50,
        "I-SECONDARYADDRESS": 58,
        "I-SSN": 82,
        "I-STATE": 18,
        "I-STREET": 17,
        "I-STREETADDRESS": 72,
        "I-SUFFIX": 65,
        "I-TIME": 74,
        "I-URL": 49,
        "I-USERAGENT": 97,
        "I-USERNAME": 98,
        "I-VEHICLEVIN": 27,
        "I-VEHICLEVRM": 32,
        "I-ZIPCODE": 57,
        "O": 26
    },
    "layer_norm_elementwise_affine": true,
    "layerdrop": 0.0,
    "max_len": 32,
    "max_position_embeddings": 2048,
    "model_name": "facebook/opt-350m",
    "model_type": "opt",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "pad_token_id": 1,
    "prefix": "</s>",
    "problem_type": "single_label_classification",
    "torch_dtype": "float32",
    "transformers_version": "4.41.2",
    "use_cache": true,
    "vocab_size": 50272,
    "word_embed_proj_dim": 512
}